{
  "sideBar": {
    "authorsPhoto": "Zdjęcie autora",
    "download": "Pobierz CV",
    "closeMenu": "Zamknij menu",
    "changeTheme": "Zmień motyw",
    "changeLanguage": "Zmień język",
    "intrested": "Zainteresowany współpracą?",
    "reachOut": "Odezwij się!"
  },
  "aboutMe": {
    "heading": "Kilka informacji o mnie:",
    "myNameIs": "Mam na imię Jakub",
    "myNameIs2": "Mieszkam w Białymstoku i szukam pracy",
    "firstAge": "Mam ",
    "secondAge": " lat",
    "firstAge2": "Od 6 lat interesuje się programo",
    "secondAge2": "waniem, a odkąd pamiętam interesuje się technologią",
    "iFinished": "Ukończyłem studia na kierunku Informatyka",
    "iFinished2": "Na których najwięcej nauczyłem się pracy w zespole",
    "iCreated": "Stworzyłem kilka większych jak i mniejszych projektów",
    "iCreated2": "Wszystkie publiczne są opisane na moim GitHubie"
  },
  "myProjects": {
    "heading": "Moje projekty:",
    "repository": "Repozytorium",
    "appDemo": "Demo aplikacji",
    "usedTech": "Użyte technologie:",
    "additionalTech": "Wspierające technologie:",
    "imageCarouselTitle": "Kliknij na zdjęcie aby przybliżyć",

    "eBakery": "E-sklep piekarni",
    "eBakeryDesc1": "Projekt e-piekarni, który obejmuje część sklepu odpowiedzialnego za sprzedaż detaliczną\n    pieczywa, jak i narzędzia do zarządzania sklepem od strony pracownika. Projekt powstawał kilka miesięcy pod\n    patronatem mojego promotora - dr Wiesława Półjanowicza. Jest to aplikacja na podstawie której obroniłem pracę\n    licencjacką o temacie \"Komputeryzacja małej firmy rodzinnej - projekt i implementacja\". ",
    "eBakeryDesc2": "Ta aplikacja była dla mnie dużym krokiem naprzód, ze względu na to że większość\n    projektów była docelowo frontem lub backendem, z drugą stroną zrobioną po łebkach. Tutaj wszystko zostało dopięte\n    na ostatni guzik. Aplikacja jest dostosowana do różnych rozmiarów ekranów, a cały design strony jest mojego\n    autorstwa. Chciałem przekonać się czy taką aplikację można zrobić od podstaw - nie korzystając z żadnych bibliotek\n    pokroju bootstrapa czy materiala, zarazem zachowując pełną spójność projektu. Większość zdjęć widocznych na stronie\n    zostały stworzone przez DeepAI.",

    "githubApi": "API wypisujące repozytoria",
    "githubApiDesc1": "Zaczęło się od tego, że projekt był zadaniem rekrutacyjnym, gdzie jedynym zadaniem było\n    pobieranie informacji o repozytoriach i branchach konkretnego usera. Postanowiłem jednak zadbać o odpowiednie\n    zabezpieczenie endpointu za pomocą SpringSecurity, jak i dorobiłem prosty, czytelny interfejs użytkownika. Mojego\n    autorstwa jest również proste logo z literką 'R'. Aplikacja jest bardzo prosta, więc nie będzie zaskoczeniem że\n    dobrze skaluje się na mniejszych urządzeniach.",

    "medpics": "Analiza zdjęć rentgenowskich",
    "medpicsDesc1": "Na zajęciach zetkneliśmy się z tematem analizy obrazów medycznych z udziałem modyfikacji\n    obrazu. Otrzymaliśmy jakieś drobne zadanie, które przerodziło się w nieco większy projekcik. Program iteruje przez\n    kilka poziomów, które ustala użytkownik, jak i ma możliwość wyboru odpowiedniej modyfikacji obrazu. Zadaniem\n    programu jest zwiększenie przejrzystości takiego obrazka.",
    "medpicsDesc2": "Wszystkie obrazki wykorzystane w projekcie zaczerpnięte zostały ze strony https://medpix.nlm.nih.gov/",

    "scheduler": "E-rezerwacja sprzętu",
    "schedulerDesc1": "Aplikacja służąca do rezerwowania terminów. Pierwotnie stworzona jako prototyp dla\n    wasilkowskiej firmy zajmującej się wyporzyczaniem przemysłowego sprzętu czyszczącego duże powierzchnie. Aby\n    zaoszczędzić czas wykorzystałem dobrodziejstwa dzisiejszych czasów - chatboty. Pozwoliło mi to zminimalizować czas\n    potrzebny na zrealizowanie takiej demonstracyjnej strony, która potem będzie dopracowywana.",
    "schedulerDesc2": "Na obecną chwilą jest tylko prostym front-endem służącego jedynie zaprezentowaniu koncepcji.\n    W obecnej wersji nie ma działającego backendu, ale zapewne niedługo się to zmieni."
  },
  "moreAboutMe": {
    "heading": "Więcej o mnie:",
    "minorHeading": "Doświadczenie:",
    "itHelp": {
      "heading": "Pomoc IT",
      "subHead": "3 lata | Pogotowie Komputerowe Łukasz Galiński",
      "desc": "Odkąd stałem się bardziej świadomym użytkownikiem technologii, zajmowałem się drobnymi naprawami / usprawnieniami\n          moich komputerów, moich bliskich. Kiedy osiągnąłem pełnoletność, zacząłem pracować w serwisie komputerowym,\n          gdzie miałem okazję doszkolić się w zakresie napraw i składania komputerów.",
      "skill1": "Składanie komputerów",
      "skill2": "Podstawowa diagnoza i naprawa jednostek",
      "skill3": "Dojazd i kontakt z klientami"
    },
    "angularDev": {
      "heading": "Junior angular developer",
      "subHead": "1 miesiąc | Nekken",
      "desc": "Praca w formie zdalnej praktyki wymaganej przez tok studiów, gdzie miałem okazję poznać podstawy Angulara oraz SpringBoota. Są to narzędzia z którymi pozostałem na dłużej. Od strony bazy danych, korzystałem z OracleSQL, którą poznałem już na zajęciach. Większość czasu zajmowałem się implementacją nowych funkcjonalności na stronie internetowej. Odbywałem regularne spotkania online nadzorujące mój postęp."
    },
    "CS": {
      "heading": "Studia informatyczne",
      "subHead": "3 lata | Uniwersytet w Białymstoku",
      "desc": "Studia licencjackie, które obroniłem w 2024. W trakcie studiów miałem kilka bardziej i kilka mniej przydatnych przedmiotów, ale mam wrażenie, że najwięcej wyniosłem z projektów grupowych, których było dużo na ostatnim roku. Praca w grupach nawet do 12 osób, oraz takich co trwały po kilka miesięcy. Tematem przewodnim ostatniego roku była praca licencjacka, która również bardzo dużo mnie nauczyła.",
      "skill1": "Wiele języków programowania",
      "skill2": "Kilka frameworków",
      "skill3": "Bazy danych - m.in. Oracle SQL"
    },
    "freelance": {
      "heading": "Grafik montażysta",
      "subHead": "Kilkanaście projektów | Brandbo",
      "desc": "Koordynator projektu znalazł mnie przez grupy na Facebooku, gdzie oferowałem swoje usługi jako grafik montażysta. Pracowałem nad różnymi projektami - głównie samodzielnie - od prostych animacji, przez montaże filmów, po tworzenie grafik koncepcyjnych na potrzeby nowych produktów firmy."
    },
    "mobileDev": {
      "heading": "Junior mobile developer",
      "subHead": "Pracuje obecnie od 10.2024 | 9Bits",
      "desc1": "Pierwsza długoterminowa praca programistyczna, w którą na dodatek wszedłem bez żadnej wiedzy o programowaniu w Androidzie. Po intensywnym tygodniu poznałem podstawy Kotlina, potrzebnych bibliotek oraz struktury projektu. Już niedługo potem implementowałem taski z jiry do aplikacji.",
      "desc2": "Z ciekawszych doświadczeń - brałem udział w trenowaniu modeli odpowiedzialnych za przetwarzanie komend głosowych. Nagrywane odbywały się przez okres całego dnia \"w terenie\", przez co zebraliśmy dokładne statystyki oraz te nagrania pozwoliły lepiej dostosować model do środowiska, w którym aplikacja rzeczywiście będzie użytkowana."
    }
  }
}
